tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "labd/mach-composer"
tap "mach-composer/mach-composer"
tap "oven-sh/bun"
tap "spicetify/tap"
tap "teamookla/speedtest"
tap "wez/wezterm"
brew "act"
brew "aws-vault"
brew "awscli"
brew "bash-completion"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "glib"
brew "cmake"
brew "php", restart_service: true
brew "composer"
brew "coreutils"
brew "deno"
brew "dnsmasq", restart_service: true
brew "eslint"
brew "eza"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gawk"
brew "go-task"
brew "gobject-introspection"
brew "gopls"
brew "helix"
brew "lf"
brew "pango"
brew "librsvg"
brew "lua-language-server"
brew "luarocks"
brew "mailhog", restart_service: true
brew "marksman"
brew "mysql"
brew "neovim"
brew "nginx", restart_service: true
brew "pass"
brew "php@8.1"
brew "pre-commit"
brew "python@3.9"
brew "ranger"
brew "ripgrep"
brew "rust-analyzer"
brew "sops"
brew "stow"
brew "stylelint"
brew "stylua"
brew "tmux"
brew "tokei"
brew "typescript-language-server"
brew "vercel-cli"
brew "vscode-langservers-extracted"
brew "wakatime-cli"
brew "wget"
brew "wp-cli"
brew "yarn", link: false
brew "ydiff"
brew "yq"
brew "zoxide"
brew "fsouza/prettierd/prettierd"
brew "jesseduffield/lazygit/lazygit"
brew "mach-composer/mach-composer/mach-composer"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "arc"
cask "bartender"
cask "hammerspoon"
cask "hoppscotch"
cask "http-toolkit"
cask "raycast"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "anteprimorac.html-end-tag-labels"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "hex-ci.stylelint-plus"
vscode "heybourn.headwind"
vscode "kamikillerto.vscode-colorize"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
