tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "jwt-rs/jwt-ui"
tap "koekeishiya/formulae"
tap "labd/mach-composer"
tap "mach-composer/mach-composer"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "spicetify/tap"
tap "sst/tap"
tap "teamookla/speedtest"
tap "wez/wezterm"
brew "act"
brew "ansible"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "bash-completion"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bottom"
brew "broot"
brew "btop"
brew "glib"
brew "cbonsai"
brew "cmake"
brew "curl"
brew "jpeg-xl"
brew "libavif"
brew "php", restart_service: :changed
brew "composer"
brew "contentful-cli"
brew "coreutils"
brew "deno"
brew "dnsmasq", restart_service: :changed
brew "docker-compose"
brew "dug"
brew "eslint"
brew "esphome"
brew "exa"
brew "eza"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "go"
brew "go-task"
brew "pkgconf"
brew "gobject-introspection"
brew "gopls"
brew "helix"
brew "icu4c@76"
brew "jq"
brew "just"
brew "lazygit"
brew "lf"
brew "pango"
brew "librsvg"
brew "lua-language-server"
brew "luarocks"
brew "marksman"
brew "mysql", restart_service: :changed
brew "mysql@8.4"
brew "neofetch"
brew "neovim"
brew "nginx", restart_service: :changed
brew "opam"
brew "ripgrep"
brew "opencode"
brew "pass"
brew "php@8.1"
brew "pre-commit"
brew "python@3.9"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rover"
brew "rust-analyzer"
brew "snitch"
brew "sops"
brew "stow"
brew "stylelint"
brew "stylua"
brew "tailscale"
brew "tmux"
brew "tokei"
brew "tree-sitter-cli"
brew "typescript-language-server"
brew "vercel-cli"
brew "vscode-langservers-extracted"
brew "wakatime-cli"
brew "wget"
brew "wp-cli"
brew "yarn", link: false
brew "yazi"
brew "ydiff"
brew "yq"
brew "zoxide"
brew "fsouza/prettierd/prettierd"
brew "gromgit/brewtils/taproom"
brew "jwt-rs/jwt-ui/jwt-ui"
brew "mach-composer/mach-composer/mach-composer"
brew "oven-sh/bun/bun"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "arc"
cask "balenaetcher"
cask "bartender"
cask "ghostty"
cask "hammerspoon"
cask "hoppscotch"
cask "http-toolkit"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "vlc"
cask "wezterm"
cask "zen"
vscode "aaron-bond.better-comments"
vscode "anteprimorac.html-end-tag-labels"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "cssho.vscode-svgviewer"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "hex-ci.stylelint-plus"
vscode "heybourn.headwind"
vscode "kamikillerto.vscode-colorize"
vscode "mikestead.dotenv"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "statelyai.stately-vscode"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
cargo "abscissa"
cargo "fd-find"
cargo "fnm"
cargo "git-delta"
cargo "inlyne"
cargo "ripgrep"
cargo "stylua"
cargo "zellij"
